In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[555,666,777,555],
    'col3':['USA','Maxico','USSR','India']
})

In [5]:
df.head()

   col1  col2    col3
0     1   555     USA
1     2   666  Maxico
2     3   777    USSR
3     4   555   India

In [6]:
df['col2'].unique()

array([555, 666, 777], dtype=int64)

In [8]:
df['col2'].nunique() # len(def['col2'].unique)

3

In [10]:
df['col2'].value_counts()

555    2
666    1
777    1
Name: col2, dtype: int64

In [12]:
df[df['col2']>=666]

   col1  col2    col3
1     2   666  Maxico
2     3   777    USSR

In [13]:
def divideby4(x):
    return x/4

In [14]:
df['col2'].sum()

2553

In [15]:
df['col2'].apply(divideby4)

0    138.75
1    166.50
2    194.25
3    138.75
Name: col2, dtype: float64

In [16]:
df

   col1  col2    col3
0     1   555     USA
1     2   666  Maxico
2     3   777    USSR
3     4   555   India

In [17]:
df['col2'].std()

106.27440896095354

In [22]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  638.250000
std    1.290994  106.274409
min    1.000000  555.000000
25%    1.750000  555.000000
50%    2.500000  610.500000
75%    3.250000  693.750000
max    4.000000  777.000000

In [23]:
df['col3'].apply(len)

0    3
1    6
2    4
3    5
Name: col3, dtype: int64

In [24]:
df['col2'].apply(lambda x: x*2)

0    1110
1    1332
2    1554
3    1110
Name: col2, dtype: int64

In [25]:
df.sort_values('col2')

   col1  col2    col3
0     1   555     USA
3     4   555   India
1     2   666  Maxico
2     3   777    USSR

In [26]:
df.sort_values(by='col3')

   col1  col2    col3
3     4   555   India
1     2   666  Maxico
0     1   555     USA
2     3   777    USSR

In [27]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [28]:
data = pd.DataFrame({
    'A': ['foo','foo','foo','bar','bar','bar'],
    'B': ['one','one','two','two','one','one'],
    'C': ['x','y','x','y','x','y'],
    'D': [1,2,5,6,7,1]
})

In [30]:
data

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  5
3  bar  two  y  6
4  bar  one  x  7
5  bar  one  y  1

In [34]:
data.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  7.0  1.0
    two  NaN  6.0
foo one  1.0  2.0
    two  5.0  NaN